# 6)В user ведёт две метки времени до секунды. Ваша задача найти математике user ведёт две метки времени до секунды. Ваша задача найти факториал user ведёт две метки времени до секунды. Ваша задача найти целого user ведёт две метки времени до секунды. Ваша задача найти числа user ведёт две метки времени до секунды. Ваша задача найти n, user ведёт две метки времени до секунды. Ваша задача найти обозначаемого user ведёт две метки времени до секунды. Ваша задача найти через user ведёт две метки времени до секунды. Ваша задача найти n! user ведёт две метки времени до секунды. Ваша задача найти
# является user ведёт две метки времени до секунды. Ваша задача найти следующим
# продукт:
# n! user ведёт две метки времени до секунды. Ваша задача найти = user ведёт две метки времени до секунды. Ваша задача найти 1 user ведёт две метки времени до секунды. Ваша задача найти × user ведёт две метки времени до секунды. Ваша задача найти 2 user ведёт две метки времени до секунды. Ваша задача найти × user ведёт две метки времени до секунды. Ваша задача найти ... user ведёт две метки времени до секунды. Ваша задача найти × user ведёт две метки времени до секунды. Ваша задача найти н
# Для user ведёт две метки времени до секунды. Ваша задача найти заданного user ведёт две метки времени до секунды. Ваша задача найти целого user ведёт две метки времени до секунды. Ваша задача найти числа user ведёт две метки времени до секунды. Ваша задача найти n
# рассчитать user ведёт две метки времени до секунды. Ваша задача найти значение user ведёт две метки времени до секунды. Ваша задача найти n user ведёт две метки времени до секунды. Ваша задача найти !. user ведёт две метки времени до секунды. Ваша задача найти
# Не user ведёт две метки времени до секунды. Ваша задача найти используйте user ведёт две метки времени до секунды. Ваша задача найти математический user ведёт две метки времени до секунды. Ваша задача найти модуль user ведёт две метки времени до секунды. Ваша задача найти в user ведёт две метки времени до секунды. Ваша задача найти этом user ведёт две метки времени до секунды. Ваша задача найти упражнении.

n=int(input("Enter the number: "))
facrotial=1
for i in range (1,n+1):
    facrotial*=i
print(facrotial)