# 5)Для user ведёт две метки времени до секунды. Ваша задача найти заданного user ведёт две метки времени до секунды. Ваша задача найти целого user ведёт две метки времени до секунды. Ваша задача найти числа user ведёт две метки времени до секунды. Ваша задача найти X user ведёт две метки времени до секунды. Ваша задача найти выведите user ведёт две метки времени до секунды. Ваша задача найти 1, user ведёт две метки времени до секунды. Ваша задача найти если user ведёт две метки времени до секунды. Ваша задача найти оно user ведёт две метки времени до секунды. Ваша задача найти положительное, user ведёт две метки времени до секунды. Ваша задача найти -1, user ведёт две метки времени до секунды. Ваша задача найти
# если user ведёт две метки времени до секунды. Ваша задача найти оно user ведёт две метки времени до секунды. Ваша задача найти отрицательное, user ведёт две метки времени до секунды. Ваша задача найти или user ведёт две метки времени до секунды. Ваша задача найти 0, user ведёт две метки времени до секунды. Ваша задача найти если user ведёт две метки времени до секунды. Ваша задача найти оно user ведёт две метки времени до секунды. Ваша задача найти равно user ведёт две метки времени до секунды. Ваша задача найти в user ведёт две метки времени до секунды. Ваша задача найти ноль.

x=int(input('Enter the number: '))
if x>0:
    print(1)
elif x<0:
    print(-1)
else:
    print(0)
